#include "my_filter.h"

#define BLOCK_SIZE 32 /* 每次调用arm_fir_f32处理的采样点个数 */

/* FIR滤波器的系数数量 */
const int BL = 51;

/* FIR滤波器系数数组（低通滤波器系数） */
const float B[51] = {
    0.002915534889, 0.003051500069, 0.00345056993, 0.004107376561, 0.005012389738,
    0.006152060814, 0.007509032264, 0.009062412195, 0.0107881017, 0.01265918091,
    0.01464633644, 0.01671833172, 0.01884250715, 0.02098530531, 0.02311281115,
    0.02519129775, 0.02718777396, 0.02907051146, 0.03080956079, 0.03237723932,
    0.0337485671, 0.03490169346, 0.03581822291, 0.03648354113, 0.0368870236,
    0.03702224046, 0.0368870236, 0.03648354113, 0.03581822291, 0.03490169346,
    0.0337485671, 0.03237723932, 0.03080956079, 0.02907051146, 0.02718777396,
    0.02519129775, 0.02311281115, 0.02098530531, 0.01884250715, 0.01671833172,
    0.01464633644, 0.01265918091, 0.0107881017, 0.009062412195, 0.007509032264,
    0.006152060814, 0.005012389738, 0.004107376561, 0.00345056993, 0.003051500069,
    0.002915534889};

/**
 * @brief 对输入数组进行FIR低通滤波
 * @param input_array 输入数据数组的指针
 * @param length 输入数据的长度
 * @param output_array 输出数据数组的指针
 * @details 该函数使用了CMSIS-DSP库的`arm_fir_f32`函数进行FIR滤波。函数会对输入数据以块为单位处理，支持不定长输入。
 */
void arm_fir_f32_lp(const float *input_array, int length, float *output_array)
{
    uint32_t i;                             /* 循环变量 */
    arm_fir_instance_f32 S;                 /* FIR滤波器实例结构体 */
    float firStateF32[BLOCK_SIZE + BL - 1]; /* FIR状态缓存，大小为BL + BLOCK_SIZE - 1 */

    /* 初始化FIR滤波器结构体 */
    arm_fir_init_f32(&S, BL, (float *)&B[0], &firStateF32[0], BLOCK_SIZE);

    /* 对输入数据进行分块滤波 */
    for (i = 0; i < length; i += BLOCK_SIZE)
    {
        /* 计算当前块的长度，如果是最后一块，长度可能不足BLOCK_SIZE */
       // uint32_t block_len = (i + BLOCK_SIZE <= length) ? BLOCK_SIZE : (length - i);

        /* 对当前块进行FIR滤波 */
       // arm_fir_f32(&S, input_array + i, output_array + i, block_len);
    }
}
